app/controllers/movies_controller.rb

  def index

    savedsession = false
    @all_ratings = Movie.get_ratings
    @dic =[]
    if(params[:ratings])
         @ratings = params[:ratings]
         @ratings.keys.each{|x| @dic=@dic.push(x)}
    elsif(session[:ratings])
         @ratings = session[:ratings]
         @ratings.keys.each{|x|
			@dic=@dic.push(x)
			savedsession = true
			}
    else
		@all_ratings.each{|x|
---
SELECT "movies".* FROM "movies" ORDER BY release_date